app/controllers/text_apps_controller.rb

  def index
    @text_apps = TextApp.all
---
SELECT "text_apps".* FROM "text_apps"

  def show
  	@text_app = TextApp.find(params[:id])
---
SELECT  "text_apps".* FROM "text_apps" WHERE "text_apps"."id" = $1 LIMIT 1  [["id", 7]]

  def create
		begin
    	@text_app = TextApp.new(text_app_params)
			account_sid = "ACf74fe283ec05664c5cc922e34831d60e"
			auth_token = "7b6baaf5e68b5cfcc7d989a731db89f4"
			client = Twilio::REST::Client.new account_sid, auth_token
	  	key = @text_app.phone_num
	  	outof = "+16144271054" # My definite number
    		respond_to do |format|
      		if @text_app.save
---
INSERT INTO "text_apps" ("phone_num", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["phone_num", "+16143269262"], ["name", "John"], ["created_at", "2016-01-28 13:00:34.274359"], ["updated_at", "2016-01-28 13:00:34.274359"]]

  def update
    respond_to do |format|
      if @text_app.update(text_app_params)
---
UPDATE "text_apps" SET "name" = $1, "updated_at" = $2 WHERE "text_apps"."id" = $3  [["name", "Heyooo"], ["updated_at", "2016-01-28 14:48:27.854665"], ["id", 4]]

    def set_text_app
      @text_app = TextApp.find(params[:id])
---
SELECT  "text_apps".* FROM "text_apps" WHERE "text_apps"."id" = $1 LIMIT 1  [["id", nil]]